In [1]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\sandeep pathak\anaconda3\lib\site-packages (8.0.32)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in c:\users\sandeep pathak\anaconda3\lib\site-packages (from mysql-connector-python) (3.19.1)
Note: you may need to restart the kernel to use updated packages.

In [2]:
# Importing the libraries

import mysql.connector
from mysql.connector import Error
import pandas as pd

In [3]:
def create_server_connection(host_name,user_name,user_password):
    
    global connection
    connection = None# 
    
    try:
        connection = mysql.connector.connect(
        host = host_name,
        user = user_name,
            password = user_password
        )
        print("MySQL connection Successfull")
        
    except Error as er:
        print(f"Error: {er}")
        
    return connection

ps = "12345"

db = "Internship"

create_server_connection("localhost","root",ps)

MySQL connection Successfull

In [4]:
# Create Database Internship

def create_database(connection,query):
    cursor = connection.cursor()
    
    try:
        cursor.execute(query)
        print("Database created Successfully")
        
    except Error as er:
        print(f"Error: {er}")
        
create_database_query = "Create Database Internship"
create_database(connection,create_database_query)

Error: 1007 (HY000): Can't create database 'internship'; database exists

In [13]:
# connect to database 

def create_db_connection(host_name,user_name,user_password,db_name):
    connection = None
    
    try:
        connection = mysql.connector.connect(
        host = host_name,
        user = user_name,
        password = user_password,
        database = db_name
        )
        print("MYSQL Database Connection Successful")
        
    except Error as er:
        print(f"Error: {er}")
        
    return connection

In [15]:
# Execute SQL Queries

global cursor

def execute_query(connection,query):
    cursor = connection.cursor()
    
    try:
        cursor.execute(query)
        connection.commit()
        print("Query was Successful")
        
    except Error as er:
        print(f"Error: {er}")

In [16]:
create_orders_table = """
Create table orders(
order_id int primary key,
customer_name varchar(30) not null,
product_name varchar(30) not null,
date_ordered date,
quantity int,
unit_price float,
phone_number varchar(30));
"""

# connect to the database

connection = create_db_connection("localhost","root",ps,db)
execute_query(connection,create_orders_table)

MYSQL Database Connection Successful
Query was Successful

In [17]:
# insert data

data_orders = """
insert into orders values
(101,'Steve',"laptop","2008-06-12",2,800,"9654875412"),
(102, 'Jos', 'Books', '2019-02-10', 10, 12, '8367489124'),
(103, 'Stacy', 'Trousers', '2019-12-25', 5, 50, '8976123645'),
(104, 'Nancy', 'T-Shirts', '2018-07-14', 7, 30, '7368145099'),
(105, 'Maria', 'Headphones', '2019-05-30', 6, 48, '8865316698'), 
(106, 'Danny', 'Smart TV', '2018-08-20', 10, 300, '7720130449');
"""

connection = create_db_connection("localhost","root",ps,db)
execute_query(connection,data_orders)

MYSQL Database Connection Successful
Query was Successful

In [18]:
def read_query(connection,query):
    cursor = connection.cursor()
    results = None
    
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as er:
        print(f"Error: {er}")

In [19]:
# Usinf Select statement

Q1 = """
Select * from orders;
"""

connection = create_db_connection("localhost","root",ps,db)
results = read_query(connection,Q1)

for result in results:
    print(result)

MYSQL Database Connection Successful
(101, 'Steve', 'laptop', datetime.date(2008, 6, 12), 2, 800.0, '9654875412')
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '8367489124')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')
(104, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 30.0, '7368145099')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')

In [20]:
from_db = []

for result in results:
    result = list(result)
    from_db.append(result)
    
columns = ["order_id", "customer_name", "product_name", "date_ordered", "quantity",
"unit_price", "phone_number"]

df = pd.DataFrame(from_db,columns = columns)
display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,101,Steve,laptop,2008-06-12,2,800.0,9654875412
1,102,Jos,Books,2019-02-10,10,12.0,8367489124
2,103,Stacy,Trousers,2019-12-25,5,50.0,8976123645
3,104,Nancy,T-Shirts,2018-07-14,7,30.0,7368145099
4,105,Maria,Headphones,2019-05-30,6,48.0,8865316698
5,106,Danny,Smart TV,2018-08-20,10,300.0,7720130449

In [21]:
Q2 = """
SELECT DISTINCT year(date_ordered) FROM orders;
"""

connection = create_db_connection("localhost","root",ps,db)
results = read_query(connection,Q2)

for result in results:
    print(result)

MYSQL Database Connection Successful
(2008,)
(2019,)
(2018,)

In [23]:
Q3 = """
DELETE FROM orders
WHERE order_id = 103;
;
"""

connection = create_db_connection("localhost","root",ps,db)
results = read_query(connection,Q3)

for result in results:
    print(result)

MYSQL Database Connection Successful

In [25]:
Q4 = """
UPDATE orders
SET quantity = 3, unit_price = 850.0
WHERE order_id = 101;

"""

connection = create_db_connection("localhost","root",ps,db)
results = read_query(connection,Q4)

for result in results:
    print(result)

MYSQL Database Connection Successful

In [27]:
Q5 = """
SELECT * FROM orders
WHERE unit_price > 50;


"""

connection = create_db_connection("localhost","root",ps,db)
results = read_query(connection,Q5)

for result in results:
    print(result)

MYSQL Database Connection Successful
(101, 'Steve', 'laptop', datetime.date(2008, 6, 12), 2, 800.0, '9654875412')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')

In [28]:
Q6 = """
SELECT * FROM orders
ORDER BY date_ordered DESC;



"""

connection = create_db_connection("localhost","root",ps,db)
results = read_query(connection,Q6)

for result in results:
    print(result)

MYSQL Database Connection Successful
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '8367489124')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')
(104, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 30.0, '7368145099')
(101, 'Steve', 'laptop', datetime.date(2008, 6, 12), 2, 800.0, '9654875412')

In [29]:
Q7 = """
SELECT * FROM orders;



"""

connection = create_db_connection("localhost","root",ps,db)
results = read_query(connection,Q7)

for result in results:
    print(result)

MYSQL Database Connection Successful
(101, 'Steve', 'laptop', datetime.date(2008, 6, 12), 2, 800.0, '9654875412')
(102, 'Jos', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '8367489124')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')
(104, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 30.0, '7368145099')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')